jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
/* MIT License

Copyright (c) 2026 Jason C. Fain

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE. */

#pragma once

#include <sstream>
#include <WiFi.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <vector>
#include <map>
#include <Wire.h>
#include "soc/rtc.h"
// // #include "LogHandler.h"
#include "utils.h"
#include "TagHandler.h"
#include "struct/voice.h"
#include "struct/motionProfile.h"
#include "struct/channel.h"
#include "struct/motionChannel.h"
#include "struct/buttonSet.h"
#include "enum.h"
#include "constants.h"
#include "channelMap.hpp"
#include "settingConstants.h"
#include "settingsFactory.h"
#include "callback.h"

#define DESERIALIZE_SIZE 32768
#define SERIALIZE_SIZE 24576

//using SETTING_STATE_FUNCTION_PTR_T = void (*)(const char *group, const char *settingNameThatChanged);

class SettingsHandler
{
public:
    static bool initialized;
    static inline bool setupSucceeded = false;
    static int restartInSecs;
    static inline const char* errorInfo[10];
    static inline size_t errorInfoIndex = 0;
    static bool saving;
    static bool motionPaused;
    static bool fullBuild;
    static inline bool channelRangesEnabled = true;
    static LogLevel logLevel;
    static std::vector<int> systemI2CAddresses;

    static ChannelMap channelMap;
    static BuildFeature buildFeatures[(int)BuildFeature::MAX_FEATURES];

    static inline MotionProfile* motionProfiles;
    static inline ButtonSet* buttonSets;
    
    // static bool staticIP;
    static char currentIP[IP_ADDRESS_LEN];
    static char currentGateway[IP_ADDRESS_LEN];
    static char currentSubnet[IP_ADDRESS_LEN];
    static char currentDns1[IP_ADDRESS_LEN];
    static char currentDns2[IP_ADDRESS_LEN];

    static bool apMode;

    static void init()
    {
        m_settingsFactory = SettingsFactory::getInstance();
        motionProfiles = m_settingsFactory->getMotionProfiles();
        buttonSets = m_settingsFactory->getButtonSets();
        setBuildFeatures();
        setMotorType();

        // loadWifiInfo(false);
        // loadSettings(false);
        loadChannels(false);
        loadMotionProfiles(false);
        loadButtons(false);

        const char* lastRebootReason = machine_reset_cause();
        LogHandler::info(_TAG, "Last reset reason: %s", lastRebootReason);
        if(!m_settingsFactory->addLastBootReason(lastRebootReason))
        {
            LogHandler::error(_TAG, "Error saving last reset reason to disk");
        }
        initialized = true;
    }

    static void setMessageCallback(SettingsChangeCallback f)
    {
        LogHandler::debug(_TAG, "setMessageCallback");
        if (f == nullptr)
        {
            message_callback = 0;
        }
        else
        {
            message_callback = f;
        }
    }

    /// The errors added will only print if the main setup fails for some reason.
    /// Otherwise use LogHandler::error
    static void addPersistentError(const char* value)
    {
        if(errorInfoIndex >= 10)
        {
            LogHandler::error("Too many errors in buffer! The last added erro is: %s", value);
            return;
        }
        //LogHandler::debug("Add persistent error: %s", value);
        errorInfo[errorInfoIndex] = value;
        errorInfoIndex++;
    }

	static void restart(const int delayInSec = 0) {
		LogHandler::info(_TAG, "Schedule device restart in %ld seconds", delayInSec);
        // Restart in main task loop
		restartInSecs = delayInSec;
	}
    
    static bool saveAll(JsonObject obj = JsonObject()) 
    {
        if(!m_settingsFactory->saveAllToDisk(obj) || !saveMotionProfiles(obj) || !saveButtons(obj))
            return false;
        return true;
    }
    
    static bool saveAll(const String& data)
    {
        LogHandler::debug(_TAG, "Save frome string");
        LogHandler::printFree();
        JsonDocument doc;
    
        DeserializationError error = deserializeJson(doc, data);
        if (error)
        {
            LogHandler::error(_TAG, "Settings save: Deserialize error: %s", error.c_str());
            return false;
        }
        LogHandler::printFree();
        JsonObject obj = doc.as<JsonObject>();
        if (!saveAll(obj))
        {
            LogHandler::error(_TAG, "Settings save: save error");
            return false;
        }
        return true;
    }

    static void getWifiInfo(char* buf)
    {
        JsonDocument doc; //100

        JsonDocument wifiDoc = m_settingsFactory->getNetworkSettings();

        doc.set(wifiDoc);
        const char* wifiPass = doc[WIFI_PASS_SETTING];
        if(strcmp(wifiPass, WIFI_PASS_DONOTCHANGE_DEFAULT)) {
            doc[WIFI_PASS_SETTING] = DECOY_PASS; // Never set to actual password
        } else {
            doc[WIFI_PASS_SETTING] = WIFI_PASS_DONOTCHANGE_DEFAULT;
        }
        const char* apPass = doc[AP_MODE_PASS];
        if(strcmp(apPass, AP_MODE_PASS_DEFAULT)) {
            doc[AP_MODE_PASS] = DECOY_PASS; // Never set to actual password
        } else {
            doc[AP_MODE_PASS] = AP_MODE_PASS_DEFAULT;
        }

        String output;
        serializeJson(doc, output);
        doc.clear();
        if (LogHandler::getLogLevel() == LogLevel::VERBOSE)
            Serial.printf("Network Info: %s\n", output.c_str());
        buf[0] = {0};
        strcpy(buf, output.c_str());
    }

    static void getSystemInfo(String &buf)
    {
        JsonDocument doc; // 3500

        doc["esp32Version"] = FIRMWARE_VERSION_NAME;
        doc["esp32VersionNum"] = FIRMWARE_VERSION;
        doc["TCodeVersion"] = m_settingsFactory->getTcodeVersion();
        doc["lastRebootReason"] = machine_reset_cause();
        doc["channelRangesEnabled"] = getChannelRangesEnabled();
        doc["setupSucceeded"] = setupSucceeded;

        JsonArray logLevels = doc["logLevels"].to<JsonArray>();
        JsonObject logLevelNone = logLevels.add<JsonObject>();
        logLevelNone["name"] = "None";
        logLevelNone["value"] = LogLevel::NONE;
        JsonObject logLevelError= logLevels.add<JsonObject>();
        logLevelError["name"] = "Error";
        logLevelError["value"] = LogLevel::ERROR;
        JsonObject logLevelWarning = logLevels.add<JsonObject>();
        logLevelWarning["name"] = "Warning";
        logLevelWarning["value"] = LogLevel::WARNING;
        JsonObject logLevelInfo = logLevels.add<JsonObject>();
        logLevelInfo["name"] = "info";
        logLevelInfo["value"] = LogLevel::INFO;
        JsonObject logLevelDebug = logLevels.add<JsonObject>();
        logLevelDebug["name"] = "Debug";
        logLevelDebug["value"] = LogLevel::DEBUG;
        JsonObject logLevelVerbose = logLevels.add<JsonObject>();
        logLevelVerbose["name"] = "Verbose";
        logLevelVerbose["value"] = LogLevel::VERBOSE;
        
        JsonArray tcodeVersions = doc["tcodeVersions"].to<JsonArray>();
        JsonObject v03 = tcodeVersions.add<JsonObject>();
        v03["name"] = "v0.3";
        v03["value"] = TCodeVersion::v0_3;
        JsonObject v04 = tcodeVersions.add<JsonObject>();
        v04["name"] = "v0.4";
        v04["value"] = TCodeVersion::v0_4;
        JsonArray boardTypes = doc["boardTypes"].to<JsonArray>();
#if CONFIG_IDF_TARGET_ESP32
        JsonObject devkit = boardTypes.add<JsonObject>();
        devkit["name"] = "Devkit";
        devkit["value"] = (uint8_t)BoardType::DEVKIT;
    #ifdef MOTOR_TYPE_SERVO
        JsonObject SR6MB = boardTypes.add<JsonObject>();
        SR6MB["name"] = "SR6MB";
        SR6MB["value"] = (uint8_t)BoardType::CRIMZZON;
        JsonObject INControl = boardTypes.add<JsonObject>();
        INControl["name"] = "IN-Control";
        INControl["value"] = (uint8_t)BoardType::ISAAC;
    #elif defined MOTOR_TYPE_BLDC
        JsonObject SSR1PCB = boardTypes.add<JsonObject>();
        SSR1PCB["name"] = "SSR1PCB";
        SSR1PCB["value"] = (uint8_t)BoardType::SSR1PCB;
    #endif
#elif CONFIG_IDF_TARGET_ESP32S3
    #ifdef S3_ZERO
        JsonObject S3_Zero = boardTypes.add<JsonObject>();
        S3_Zero["name"] = "S3 Zero";
        S3_Zero["value"] = (uint8_t)BoardType::ZERO;
    #else
        JsonObject N8R8 = boardTypes.add<JsonObject>();
        N8R8["name"] = "S3 N8R8";
        N8R8["value"] = (uint8_t)BoardType::N8R8;
    #endif
#elif CONFIG_IDF_TARGET_ESP32C5
    JsonObject c5Devkit = boardTypes.add<JsonObject>();
    c5Devkit["name"] = "DEVKIT C5";
    c5Devkit["value"] = (uint8_t)BoardType::DEVKIT_C5;
#elif CONFIG_IDF_TARGET_ESP32C6
    JsonObject c6Devkit = boardTypes.add<JsonObject>();
    c6Devkit["name"] = "DEVKIT C6";
    c6Devkit["value"] = (uint8_t)BoardType::DEVKIT_C6;
#endif
    JsonArray wifiBands = doc["wifiBands"].to<JsonArray>();
    JsonObject modeAuto = wifiBands.add<JsonObject>();
    modeAuto["name"] = "Auto";
    modeAuto["value"] = (uint8_t)WifiBand::AUTO;
    JsonObject mode24g = wifiBands.add<JsonObject>();
    mode24g["name"] = "2.4ghz";
    mode24g["value"] = (uint8_t)WifiBand::MODE24ghz;

