jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
        LogHandler::info(_TAG, "Loading channel profile");
        return loadSettingsJson(CHANNELS_SETTINGS_PATH, loadDefault, m_channelsMutex, [](const JsonObject json, bool& mutableLoadDefault) -> bool {
                
            JsonArray channelProfileObj = json[CHANNEL_PROFILE].as<JsonArray>();
            
            if(channelProfileObj.isNull()) {
                LogHandler::info(_TAG, "No channel profile stored, loading default");
                mutableLoadDefault = true;
            } else {
                for (JsonObject profileObj : channelProfileObj) {
                    const char* name = profileObj[CHANNEL_NAME];
                    Channel* channel = channelMap.get(name);
                    if(!channel)
                    {
                        LogHandler::error(_TAG, "Channel missing from stored profile: %s", name);
                        continue;
                    }
                    channel->userMin = profileObj[CHANNEL_USER_MIN] | TCODE_MIN;
                    channel->userMid = profileObj[CHANNEL_USER_MID] | TCODE_MID;
                    channel->userMax = profileObj[CHANNEL_USER_MAX] | TCODE_MAX;
                    channel->rangeLimitEnabled = profileObj[CHANNEL_RANGE_LIMIT_ENABLED];
                    LogHandler::debug(_TAG, "Loading channel profile '%s' from settings", name);
                }
            }
        return true;
        }, saveChannels, json);
    }

    static bool saveChannels(JsonObject json = JsonObject()) {
        LogHandler::info(_TAG, "Save channel profile file");
        saving = true;
		xSemaphoreTake(m_channelsMutex, portMAX_DELAY);
        if (!LittleFS.exists(CHANNELS_SETTINGS_PATH)) {
            LogHandler::error(_TAG, "Channel profile file did not exist whan saving.");
            saving = false;
            xSemaphoreGive(m_channelsMutex);
            return false;
        }
        if(!json.isNull()) { // If passed in, load the json into memory before flushing it to disk.
            // WARNING: watchout for the mutex taken in this method. Changing these parameters below may result in hard locks.
            loadChannels(false, json); // DO NOT PASS loadDefault as true else infinit loop
        }
        JsonDocument doc; //serializeSize
        for (int i=0; i < channelMap.count(); i++) {
            Channel* channel = channelMap.get(i);
            doc[CHANNEL_PROFILE][i][CHANNEL_NAME] = channel->Name;
            doc[CHANNEL_PROFILE][i][CHANNEL_USER_MIN] = channel->userMin;
            doc[CHANNEL_PROFILE][i][CHANNEL_USER_MID] = channel->userMid;
            doc[CHANNEL_PROFILE][i][CHANNEL_USER_MAX] = channel->userMax;
            doc[CHANNEL_PROFILE][i][CHANNEL_RANGE_LIMIT_ENABLED] = channel->rangeLimitEnabled;
            if(initialized) {
                sendMessage(SettingProfile::ChannelRanges, CHANNEL_PROFILE);
            }
        }
        File file = LittleFS.open(CHANNELS_SETTINGS_PATH, FILE_WRITE);
        if (serializeJson(doc, file) == 0) {
            LogHandler::error(_TAG, "Failed to write to channel profile file");
            file.close();
            xSemaphoreGive(m_channelsMutex);
            saving = false;
            return false;
        }
        
        xSemaphoreGive(m_channelsMutex);
        saving = false;
        return true;
    }

    static std::vector<MotionChannel>& getMotionChannels()
    {
        return motionProfiles[motionSelectedProfileIndex].channels;
    }
    
    static bool getMotionEnabled()
    {
        return motionEnabled;
    }
    static void setMotionEnabled(const bool& newValue)
    {
        setValue(newValue, motionEnabled, SettingProfile::MotionProfile, MOTION_ENABLED);
    }
    static bool getMotionPaused()
    {
        return motionPaused;
    }
    static void setMotionPaused(const bool& newValue)
    {
        setValue(newValue, motionPaused, SettingProfile::MotionProfile, MOTION_PAUSED);
    }

    static int getMotionDefaultProfileIndex() 
    {
        return motionDefaultProfileIndex;
    }
    static void setMotionProfileName(const char newValue[MAX_MOTION_PROFILE_NAME_LENGTH])
    {
        strcpy(motionProfiles[motionSelectedProfileIndex].motionProfileName, newValue);
    }

    // static int getMotionUpdateGlobal(const char name[3])
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionUpdateGlobal;
    // }
    // static void setMotionUpdateGlobal(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionUpdateGlobal, "motionGenerator", "motionUpdateGlobal");
    // }
    // static int getMotionPeriodGlobal()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionPeriodGlobal;
    // }
    // static void setMotionPeriodGlobal(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionPeriodGlobal, "motionGenerator", "motionPeriodGlobal");
    // }
    // static int getMotionAmplitudeGlobal()
    //  {
    //     return motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobal;
    // }
    // static void setMotionAmplitudeGlobal(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobal, "motionGenerator", "motionAmplitudeGlobal");
    // }
    // static int getMotionOffsetGlobal()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionOffsetGlobal;
    // }
    // static void setMotionOffsetGlobal(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionOffsetGlobal, "motionGenerator", "motionOffsetGlobal");
    // }
    // static float getMotionPhaseGlobal()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionPhaseGlobal;
    // }
    // static void setMotionPhaseGlobal(const float& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionPhaseGlobal, "motionGenerator", "motionPhaseGlobal");
    // }
    // static bool getMotionReversedGlobal()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionReversedGlobal;
    // }
    // static void setMotionReversedGlobal(const bool& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionReversedGlobal, "motionGenerator", "motionReversedGlobal");
    // }
    // static bool getMotionPeriodGlobalRandom()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionPeriodGlobalRandom;
    // }
    // static void setMotionPeriodGlobalRandom(const bool& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionPeriodGlobalRandom, "motionGenerator", "motionPeriodGlobalRandom");
    // }
    // static int getMotionPeriodGlobalRandomMin()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionPeriodGlobalRandomMin;
    // }
    // static void setMotionPeriodGlobalRandomMin(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionPeriodGlobalRandomMin, "motionGenerator", "motionPeriodGlobalRandomMin");
    // }
    // static int getMotionPeriodGlobalRandomMax()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionPeriodGlobalRandomMax;
    // }
    // static void setMotionPeriodGlobalRandomMax(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionPeriodGlobalRandomMax, "motionGenerator", "motionPeriodGlobalRandomMax");
    // }
    // static bool getMotionAmplitudeGlobalRandom()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobalRandom ;
    // }
    // static void setMotionAmplitudeGlobalRandom(const bool& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobalRandom, "motionGenerator", "motionAmplitudeGlobalRandom");
    // }
    // static int getMotionAmplitudeGlobalRandomMin()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobalRandomMin;
    // }
    // static void setMotionAmplitudeGlobalRandomMin(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobalRandomMin = newValue, "motionGenerator", "motionAmplitudeGlobalRandomMin");
    // }
    // static int getMotionAmplitudeGlobalRandomMax()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobalRandomMax;
    // }
    // static void setMotionAmplitudeGlobalRandomMax(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionAmplitudeGlobalRandomMax = newValue, "motionGenerator", "motionAmplitudeGlobalRandomMax");
    // }
    // static bool getMotionOffsetGlobalRandom()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionOffsetGlobalRandom;
    // }
    // static void setMotionOffsetGlobalRandom(const bool& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionOffsetGlobalRandom = newValue, "motionGenerator", "motionOffsetGlobalRandom");
    // }
    // static int getMotionOffsetGlobalRandomMin()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionOffsetGlobalRandomMin;
    // }
    // static void setMotionOffsetGlobalRandomMin(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionOffsetGlobalRandomMin, "motionGenerator", "motionOffsetGlobalRandomMin");
    // }
    // static int getMotionOffsetGlobalRandomMax()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionOffsetGlobalRandomMax;
    // }
    // static void setMotionOffsetGlobalRandomMax(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionOffsetGlobalRandomMax = newValue, "motionGenerator", "motionOffsetGlobalRandomMax");
    // }
    // static int getMotionRandomChangeMin()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionRandomChangeMin;
    // }
    // static void setMotionRandomChangeMin(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionRandomChangeMin, "motionGenerator", "motionRandomChangeMin");
    // }
    // static int getMotionRandomChangeMax()
    // {
    //     return motionProfiles[motionSelectedProfileIndex].motionRandomChangeMax;
    // }
    // static void setMotionRandomChangeMax(const int& newValue)
    // {
    //     setValue(newValue, motionProfiles[motionSelectedProfileIndex].motionRandomChangeMax, "motionGenerator", "motionRandomChangeMax");
    // }

    static int motionProfileExists(const char* profile) {
        for (size_t i = 0; i < MAX_MOTION_PROFILE_COUNT; i++)
        {
            if (strcmp(motionProfiles[i].motionProfileName, profile) == 0)
                return (int)i;
        }
        return -1;
    }

    static void setMotionDefaults() {
        setMotionEnabled(false);
        auto motionProfile = MotionProfile(motionSelectedProfileIndex + 1);
        setMotionProfile(motionProfile, motionSelectedProfileIndex);
    }

    static void setMotionProfile(const char profile[MAX_MOTION_PROFILE_NAME_LENGTH]) {
        auto index = motionProfileExists(profile);
        if(index < 0) {
            LogHandler::error(_TAG, "Motion profile %s does not exist", profile);
            return;
        }
        setMotionProfile(index);
    }

    static void setMotionProfile(const int& index) {
        if(index < 0 || index > MAX_MOTION_PROFILE_COUNT - 1) {
            LogHandler::error(_TAG, "Invalid motion profile index: %ld", index);
            return;
        }
        auto newProfile = motionProfiles[index];
        setMotionProfile(newProfile, index);
    }

    static void setMotionProfile(const MotionProfile& profile, int profileIndex) {
        if(profileIndex < 0 || profileIndex > MAX_MOTION_PROFILE_COUNT - 1) {
            LogHandler::error(_TAG, "Invalid motion profile index: %ld", profileIndex);
            return;
        }
        //m_settingsFactory->setValue(MOTION_PROFILE_SELECTED_INDEX, profileIndex);
        setValue(profileIndex, motionSelectedProfileIndex, SettingProfile::MotionProfile, MOTION_PROFILE_SELECTED_INDEX);
    }
    
    static void cycleMotionProfile() {
        if(!getMotionEnabled()) {
            setMotionEnabled(true);
            return;
        }
        uint8_t newProfileIndex = motionSelectedProfileIndex + 1;
        if(newProfileIndex > MAX_MOTION_PROFILE_COUNT - 1) {
            newProfileIndex = 0;
            setMotionEnabled(false);
        }
        auto newProfile = motionProfiles[newProfileIndex];
        setMotionProfile(newProfile, newProfileIndex);
    }

    static const bool readFile(char* &buf, const char* path) {
        if(!LittleFS.exists(path)) {
            LogHandler::error(_TAG, "Path did not exist when reading contents: %s", path);
            return false;
        }
        File file = LittleFS.open(path, "r");
        LogHandler::printFree();
        String fileStr = file.readString();
        //buf = static_cast<char*>(malloc(fileStr.length() + 1));
        LogHandler::printFree();
        LogHandler::info(_TAG, "Create buffer: %u", fileStr.length());
        buf = new char[fileStr.length() + 1];
        strcpy(buf, fileStr.c_str());
        return true;
    }

